monte-monte/ch32v003fun/minichlink/minichlink.c
				if( argchar[1] == 'G' && SetupGDBServer( dev ) )
				{
					fprintf( stderr, "Error: can't start GDB server\n" );
					return -1;
				}
				if( argchar[1] == 'G' )
				{
					fprintf( stderr, "GDBServer Running\n" );
				}
				else if( argchar[1] == 'T' )
				{
					// In case we aren't running already.
					MCF.HaltMode( dev, 1 );
				}

				CaptureKeyboardInput();
				printf( "Terminal started\n\n" );

#if TERMINAL_INPUT_BUFFER
				char pline_buf[256]; // Buffer that contains current line that is being printed to
				char input_buf[128]; // Buffer that contains user input until it is sent out
				memset( pline_buf, 0, sizeof(pline_buf) );
				memset( input_buf, 0, sizeof(input_buf) );
				uint8_t input_pos = 0;
				uint8_t to_send = 0;
				uint8_t nice_terminal = isatty( fileno(stdout) );
#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
				unsigned long console_mode;
				void* handle_output = GetStdHandle(STD_OUTPUT_HANDLE);
				GetConsoleMode(handle_output, &console_mode);
				console_mode |= ENABLE_PROCESSED_OUTPUT | ENABLE_VIRTUAL_TERMINAL_PROCESSING;
				uint8_t set_result = SetConsoleMode(handle_output, console_mode);
				if ( set_result == 0 ) nice_terminal = 0;
#else
				if( nice_terminal > 0 )
				{
					fflush( stdin );
					fprintf( stdout, "\x1b[6n" );
					fflush( stdout );
					read( fileno(stdin), input_buf, 10 );
					if (input_buf[0] != 27)
					{
						nice_terminal = 0;
					}
					else
					{
						printf( TERMINAL_SEND_LABEL );
						fflush( stdout );
					}
					memset( input_buf, 0, sizeof(input_buf) );
				}
#endif
#endif
				uint32_t appendword = 0;
				do
				{
					uint8_t buffer[256];
#if TERMINAL_INPUT_BUFFER
					char print_buf[TERMINAL_BUFFER_SIZE]; // Buffer that is filled with everything and will be written to stdout (basically it's for formatting)
					uint8_t update = 0;
#endif
					if( !IsGDBServerInShadowHaltState( dev ) )
					{
						// Handle keyboard input.
#if TERMINAL_INPUT_BUFFER
						if ( nice_terminal > 0 ) 
						{
							if( IsKBHit() && to_send == 0 )
							{
								uint8_t c = ReadKBByte();
								if ( c == 8 || c == 127 )
								{
									input_buf[input_pos - 1] = 0;
									if ( input_pos > 0 ) input_pos--;
								}
								else if ( c > 31 && c < 127 )
								{
									input_buf[input_pos] = c;
									input_pos++;
								}
								else if ( c == '\n' || c == 10 )
								{
									to_send = input_pos;
								}
								update = 1;
							}
							// Process incomming buffer during sending
							if( to_send > 0 && appendword == 0 )
							{
								for( int i = 0; i < 3; i++ )
								{
									appendword |= input_buf[input_pos - to_send] << ( i * 8 + 8 );
									to_send--;
									if ( to_send == 0 ) break;
								}
								if( to_send == 0 )
								{
									snprintf(print_buf, TERMINAL_BUFFER_SIZE - 1, "%s%s%s\n%s%s", TERMINAL_CLEAR_CUR, TERMIANL_INPUT_SENT, input_buf, pline_buf, TERMINAL_SEND_LABEL);
									fwrite( print_buf, strlen( print_buf ), 1, stdout );
									fflush( stdout );
									input_pos = 0;
									memset( input_buf, 0, sizeof( input_buf ) );
								}
								appendword |= i + 4;
							}
						}
						else
						{
							if( appendword == 0 )
							{
								int i;
								for( i = 0; i < 3; i++ )
								{
									if( !IsKBHit() ) break;
									appendword |= ReadKBByte() << (i*8+8);
								}
								appendword |= i+4; // Will go into DATA0.
							}
						}
#else
						if( appendword == 0 )
						{
							int i;
							for( i = 0; i < 3; i++ )
							{
								if( !IsKBHit() ) break;
								appendword |= ReadKBByte() << (i*8+8);
							}
							appendword |= i+4; // Will go into DATA0.
						}
#endif
						int r = MCF.PollTerminal( dev, buffer, sizeof( buffer ), appendword, 0 );
#if TERMINAL_INPUT_BUFFER
						if( (nice_terminal > 0) && ( r == -1 || r == 0 ) && update > 0 )
						{
							strncpy( print_buf, TERMINAL_CLEAR_CUR, TERMINAL_BUFFER_SIZE - 1 );
							if ( to_send > 0 ) strncat( print_buf, TERMINAL_DIM, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) );
							strncat( print_buf, TERMINAL_SEND_LABEL, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) );
							strncat( print_buf, input_buf, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) );
							fwrite( print_buf, strlen( print_buf ), 1, stdout );
							fflush( stdout );
						}
#endif
						if( r < -5 )
						{
							fprintf( stderr, "Terminal dead.  code %d\n", r );
							return -32;
						}
						else if( r < 0 )
						{
							// Other end ack'd without printf. (Or there is another situation)
							appendword = 0;
						}
						else if( r > 0 )
						{
#if TERMINAL_INPUT_BUFFER
							if ( nice_terminal )
							{
								int new_line = -1;
								for( int i = r; i > 0; i-- )
								{
									if( buffer[i-1] == '\n' )
									{
										new_line = r - i;
										break;
									}
								}
								if( new_line < 0 )
								{
									strncpy( print_buf, TERMINAL_CLEAR_PREV, TERMINAL_BUFFER_SIZE - 1 ); //  Go one line up and erase it
									strncat( pline_buf, (char *)buffer, r); // Add newly received chars to line buffer
								}
								else
								{
									strncpy( print_buf, TERMINAL_CLEAR_CUR, TERMINAL_BUFFER_SIZE - 1 ); // Go to the start of the line and erase it
									strncat( pline_buf, (char *)buffer, r - new_line ); // Add newly received chars to line buffer
								}
								strncat( print_buf, pline_buf, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) ); // Add line to buffer
								if( new_line >= 0 )
								{
									memset( pline_buf, 0, sizeof( pline_buf ) );
								}
								if( new_line > 0)
								{
									strncat( pline_buf, (char *)buffer+r-new_line, new_line );
									strncat( print_buf, pline_buf, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) ); // Add line to buffer
								}
								
								if( to_send > 0 ) strncat( print_buf, TERMINAL_DIM, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) );
								strncat( print_buf, TERMINAL_SEND_LABEL, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) ); // Print styled "Send" label
								strncat( print_buf, input_buf, TERMINAL_BUFFER_SIZE - 1 - strlen(print_buf) ); // Print current input
								fwrite( print_buf, strlen( print_buf ), 1, stdout );
								print_buf[0] = 0;
								// memset( print_buf, 0, sizeof( print_buf ) );
								
