monte-monte/ch32v003fun/minichlink/minichlink.c
	return 0;
}

static int DefaultWaitForDoneOp( void * dev, int ignore )
{
	int r;
	uint32_t rrv;
	int timeout = 100;

	do
	{
		r = MCF.ReadReg32( dev, DMABSTRACTCS, &rrv );
		if( r ) return r;
	}
	while( (rrv & (1<<12)) && timeout-- );

	if( ((rrv >> 8 ) & 7) || (rrv & (1<<12)) )
	{
		if( !ignore )
		{
			const char * errortext = 0;
			switch( (rrv>>8)&7 )
			{
			case 1: errortext = "Command in execution"; break;
			case 2: errortext = "Abstract Command Unsupported"; break;
			case 3: errortext = "Execption executing Abstract Command"; break;
			case 4: errortext = "Processor not halted."; break;
			case 5: errortext = "Bus Error"; break;
			case 6: errortext = "Parity Bit"; break;
			default: errortext = "Other Error"; break;
			}

			uint32_t temp;
			MCF.ReadReg32( dev, DMSTATUS, &temp );
			fprintf( stderr, "Fault on op (DMABSTRACTS = %08x) (%d) (%s) DMSTATUS: %08x\n", rrv, timeout, errortext, temp );
		}
		MCF.WriteReg32( dev, DMABSTRACTCS, 0x00000700 );
		return -9;
	}
	return 0;
}

int DefaultSetupInterface( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);

	if( MCF.Control3v3 ) MCF.Control3v3( dev, 1 );
	MCF.DelayUS( dev, 16000 );
	MCF.WriteReg32( dev, DMSHDWCFGR, 0x5aa50000 | (1<<10) ); // Shadow Config Reg
	MCF.WriteReg32( dev, DMCFGR, 0x5aa50000 | (1<<10) ); // CFGR (1<<10 == Allow output from slave)
	MCF.WriteReg32( dev, DMSHDWCFGR, 0x5aa50000 | (1<<10) ); // sometimes doing this just once isn't enough
	MCF.WriteReg32( dev, DMCFGR, 0x5aa50000 | (1<<10) ); // And this is about as fast as checking, so why not.

	// Read back chip status.  This is really basic.
	uint32_t reg = 0;
	int r = MCF.ReadReg32( dev, DMSTATUS, &reg );
	if( r >= 0 )
	{
		// Valid R.
		if( reg == 0x00000000 || reg == 0xffffffff )
		{
			fprintf( stderr, "Error: Setup chip failed. Got code %08x\n", reg );
			return -9;
		}
	}
	else
	{
		fprintf( stderr, "Error: Could not read dmstatus.\n" );
		return r;
	}

	iss->statetag = STTAG( "STRT" );
	return 0;
}

int DefaultGetUUID( void * dev, uint8_t * buffer)
{
  struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
  if( !iss->target_chip )
  {
    MCF.DetermineChipType( dev );
  }
  int ret;
  uint8_t local_buffer[8] = {0, 0, 0, 0, 0, 0, 0, 0};
  enum RiscVChip chip = iss->target_chip_type;

  if( chip == CHIP_CH32M030 )
  {
    MCF.WriteReg32( dev, DMPROGBUF0, 0x90024000 );	// c.ebreak <<== c.lw x8, 0(x8)
    MCF.WriteReg32( dev, DMDATA0, 0x1ffff3a8 );			
    MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
    MCF.WaitForDoneOp( dev, 0 );
    MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
    MCF.ReadReg32( dev, DMDATA0, (uint32_t*)local_buffer );
    MCF.WriteReg32( dev, DMDATA0, 0x1ffff3ac );			
    MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
    MCF.WaitForDoneOp( dev, 0 );
    MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
    MCF.ReadReg32( dev, DMDATA0, (uint32_t*)(local_buffer + 4) );
    *((uint32_t*)buffer) = local_buffer[0]<<24|local_buffer[1]<<16|local_buffer[2]<<8|local_buffer[3];
    *(((uint32_t*)buffer)+1) = local_buffer[4]<<24|local_buffer[5]<<16|local_buffer[6]<<8|local_buffer[7];
  }
  else if( chip == CHIP_CH32V003 ||
          chip == CHIP_CH32V00x ||
          chip == CHIP_CH32L10x ||
          chip == CHIP_CH32V10x ||
          chip == CHIP_CH32V20x ||
          chip == CHIP_CH32V30x ||
          chip == CHIP_CH32V317 ||
          chip == CHIP_CH32X03x ||
          chip == CHIP_CH564 ||
          chip == CHIP_CH641 ||
          chip == CHIP_CH643 ||
          chip == CHIP_CH645 )
  {
    MCF.WriteReg32( dev, DMPROGBUF0, 0x90024000 );	// c.ebreak <<== c.lw x8, 0(x8)
    MCF.WriteReg32( dev, DMDATA0, 0x1ffff7e8 );			
    MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
    MCF.WaitForDoneOp( dev, 0 );
    MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
    MCF.ReadReg32( dev, DMDATA0, (uint32_t*)local_buffer );
    MCF.WriteReg32( dev, DMDATA0, 0x1ffff7ec );
    MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
    MCF.WaitForDoneOp( dev, 0 );
    MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
    MCF.ReadReg32( dev, DMDATA0, (uint32_t*)(local_buffer + 4) );
    *((uint32_t*)buffer) = local_buffer[0]<<24|local_buffer[1]<<16|local_buffer[2]<<8|local_buffer[3];
    *(((uint32_t*)buffer)+1) = local_buffer[4]<<24|local_buffer[5]<<16|local_buffer[6]<<8|local_buffer[7];
  }
  else if( chip == CHIP_CH56x ||
          chip == CHIP_CH570 ||
          chip == CHIP_CH57x ||
          chip == CHIP_CH58x ||
          chip == CHIP_CH585 ||
          chip == CHIP_CH59x )
  {
    ret = ch5xx_read_uuid( dev, local_buffer );
    memcpy(buffer, local_buffer, 8);
  }
  return ret;
}

int DefaultDetermineChipType( void * dev )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	if( !iss->target_chip )
	{
		uint32_t rr;
		if( MCF.ReadReg32( dev, DMHARTINFO, &rr ) )
		{
			fprintf( stderr, "Error: Could not get hart info.\n" );
			return -1;
		}

		MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Make the debug module work properly.
		MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Initiate halt request.

		// Tricky, this function needs to clean everything up because it may be used entering debugger.
		uint32_t old_data0;
		MCF.ReadReg32( dev, DMDATA0, &old_data0 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
		uint32_t old_x8;
		MCF.ReadReg32( dev, DMDATA0, &old_x8 );

		uint32_t marchid = 0;

		MCF.WriteReg32( dev, DMABSTRACTCS, 0x08000700 ); // Clear out any dmabstractcs errors.

		MCF.WriteReg32( dev, DMABSTRACTAUTO, 0x00000000 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | 0xf12 );
		MCF.WriteReg32( dev, DMCOMMAND, 0x00220000 | 0xf12 );  // Need to double-read, not sure why.
		MCF.ReadReg32( dev, DMDATA0, &marchid );
    MCF.WriteReg32( dev, DMPROGBUF0, 0x90024000 );		// c.ebreak <<== c.lw x8, 0(x8)

    // uint8_t family_id = 0;
    uint32_t chip_id = 0;
    uint32_t vendor_bytes = 0;
    uint32_t sevenf_id = 0;
    MCF.ReadReg32( dev, DMCHIPID, &sevenf_id );
    // fprintf(stderr, "sevenf_id = %08x\n", sevenf_id);
    
    if( sevenf_id == 0 )
    {
      // Need to load new progbuf because we're reading 1 byte now
      MCF.WriteReg32( dev, DMPROGBUF0, 0x00040403 ); // lb x8, 0(x8)
	    MCF.WriteReg32( dev, DMPROGBUF1, 0x00100073 ); // c.ebreak
      MCF.WriteReg32( dev, DMDATA0, 0x40001041 );			// Special chip ID location.
		  MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
		  MCF.WaitForDoneOp( dev, 0 );
      MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
      MCF.ReadReg32( dev, DMDATA0, &chip_id );
      chip_id = chip_id & 0xff;
      // fprintf(stderr, "chip_id = %08x\n", chip_id);

      // Looks like a CH32V103 or a CH56x
      if( chip_id == 0 )
      {
        // First check for CH56x
        MCF.WriteReg32( dev, DMDATA0, 0x40001001 );			
        MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
        MCF.WaitForDoneOp( dev, 1 );
        MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
        MCF.ReadReg32( dev, DMDATA0, &chip_id );
        MCF.WriteReg32( dev, DMDATA0, 0x40001002 );			// Special chip ID location.
        MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
        MCF.WaitForDoneOp( dev, 1 );
        MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
        MCF.ReadReg32( dev, DMDATA0, &vendor_bytes );

