monte-monte/ch32v003fun/minichlink/minichlink.c
        if( (vendor_bytes & 0xff) == 2 && ((chip_id & 0xff) == 65 || (chip_id & 0xff) == 69) )
        {
          if( (chip_id & 0xff) == 0x65 ) iss->target_chip = &ch565;
          if( (chip_id & 0xff) == 0x69 ) iss->target_chip = &ch569;
          iss->target_chip_id = chip_id << 24;
          fprintf( stderr, "Found interesting specimen, please tell us about it in Discord or on GitHub, and provide this value: %02x\n", chip_id);
          goto chip_identified;
        }

        // Now actually check for CH32V103
        MCF.WriteReg32( dev, DMPROGBUF0, 0x90024000 );	// c.ebreak <<== c.lw x8, 0(x8)
        MCF.WriteReg32( dev, DMDATA0, 0x1ffff880 );			// Special chip ID location.
        MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
        MCF.WaitForDoneOp( dev, 1 );
        MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
        MCF.ReadReg32( dev, DMDATA0, &chip_id );
        MCF.WriteReg32( dev, DMDATA0, 0x1ffff884 );			// Special chip ID location.
        MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
        MCF.WaitForDoneOp( dev, 1 );
        MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
        MCF.ReadReg32( dev, DMDATA0, &vendor_bytes );
        
        if( ((((vendor_bytes >> 16) & 0xff00) != 0x2500) && (((vendor_bytes >> 16) & 0xdf00) != 0x1500)) || chip_id != 0xdc78fe34 )
        {
          uint32_t flash_obr = 0;
          MCF.WriteReg32( dev, DMDATA0, 0x4002201c );			// Special chip ID location.
          MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
          MCF.WaitForDoneOp( dev, 1 );
          MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
          MCF.ReadReg32( dev, DMDATA0, &flash_obr );
            
          if( (flash_obr & 3) == 2 )
          {
            iss->target_chip = &ch32v103;
            fprintf( stderr, "Found CH32V103, but it's read protected, just so you know.\n");
          }
        }
        else
        {
          iss->target_chip = &ch32v103;
          iss->target_chip_id = vendor_bytes;
        }
      }
      else
      {
        // Check for CH5xx        
        if( (chip_id & 0xf0) == 0x90 )
        {
          
          uint32_t sevenc = 0;
          MCF.ReadReg32( dev, DMCPBR, &sevenc );
          // fprintf(stderr, "sevenc = %08x\n", sevenc);
          if((sevenc & 0x30000) == 0)
          {
            if( chip_id == 0x91 )iss->target_chip = &ch591;
            if( chip_id == 0x92 )iss->target_chip = &ch592;
            uint32_t some_option = 0;
            // _ch5xx_read_options(dev, 0x7f010, &some_option, 4);
            if (some_option == 9) {
              iss->target_chip_id = chip_id << 24 | 9;
            }
            else
            {
              iss->target_chip_id = chip_id << 24;
            }
          }
          else
          {
            iss->target_chip = &ch585;
            iss->target_chip_id = chip_id << 24;
          }
        }
        else
        {
          if( chip_id == 0x70 )
          {
            iss->target_chip = &ch570;
            iss->target_chip_id = chip_id << 24;
          }
          else if( chip_id == 0x71 )
          {
            iss->target_chip = &ch571;
            iss->target_chip_id = chip_id << 24;
          }
          else if( chip_id == 0x72 )
          {
            iss->target_chip = &ch572;
            iss->target_chip_id = chip_id << 24;
          }
          else if( chip_id == 0x73 )
          {
            uint32_t ch573_variant = 0;
            // _ch5xx_read_options(0x7f00c, &ch573_variant, 4);
            if( (int)(ch573_variant << 18) < 0 )
            {
              iss->target_chip = &ch573q;
              iss->target_chip_id = 0x73550000;
            }
            else
            {
              iss->target_chip = &ch573;
              iss->target_chip_id = chip_id << 24;
            }
          }
          else if( chip_id == 0x82 )
          {
            iss->target_chip = &ch582;
            iss->target_chip_id = chip_id << 24;
          }
          else if( chip_id == 0x83 )
          {
            iss->target_chip = &ch583;
            iss->target_chip_id = chip_id << 24;
          }
        }
      }
    }
    else
    {
      uint32_t chip_id_address = 0x1ffff7c4;;
      uint32_t masked_id = sevenf_id & 0xfff00000;
      uint32_t masked_id2 = sevenf_id & 0xfff00f00;
      if( masked_id == 0x3b00000 )
      {
        iss->target_chip = &ch32m030;
        iss->target_chip_id = sevenf_id;
        goto chip_identified;
      }
      else if( masked_id == 0x56400000 )
      {
        iss->target_chip = &ch564;
        iss->target_chip_id = sevenf_id;
        goto chip_identified;
      }
      else if( masked_id == 0x31700000 )
      {
        iss->target_chip = &ch32v317;
        chip_id_address = 0x1ffff704;
      }
      else if( masked_id == 0x00200000 )
      {
        iss->target_chip = &ch32v002;
        chip_id_address = 0x1ffff704;
      }
      else if( masked_id == 0x00400000 )
      {
        iss->target_chip = &ch32v004;
        chip_id_address = 0x1ffff704;
      }
      else if( masked_id == 0x00600000 )
      {
        iss->target_chip = &ch32v006;
        chip_id_address = 0x1ffff704;
      }
      else if( masked_id == 0x00700000 )
      {
        iss->target_chip = &ch32v007;
        chip_id_address = 0x1ffff704;
      }

      if( masked_id2 == 0x64100500 )
      {
        iss->target_chip = &ch641;
      }
      else if( masked_id2 == 0x64300600 )
      {
        iss->target_chip = &ch643;
      }
      else if( masked_id == 0x64500000 )
      {
        iss->target_chip = &ch645;
      }
      else if( masked_id2 == 0x3500600 )
      {
        iss->target_chip = &ch32x035;
      }
      else if( masked_id2 == 0x10300700 )
      {
        iss->target_chip = &ch32l103;
      }
      else if( masked_id2 == 0x300500 )
      {
        iss->target_chip = &ch32v003;
      }

      if( (chip_id & 0x30000500) == 0x30000500 )
      {
        iss->target_chip = &ch32v303;
      }
      if( (chip_id & 0x20000500) == 0x20000500 )
      {
        iss->target_chip = &ch32v203;
      }
      
      if( iss-> target_chip )
      {
        MCF.WriteReg32( dev, DMDATA0, chip_id_address );			// Special chip ID location.
        MCF.WriteReg32( dev, DMCOMMAND, 0x00271008 );		// Copy data to x8, and execute.
        MCF.WaitForDoneOp( dev, 1 );
        MCF.WriteReg32( dev, DMCOMMAND, 0x00221008 );		// Copy data from x8.
        MCF.ReadReg32( dev, DMDATA0, &chip_id );
        // fprintf(stderr, "chip_id = %08x\n", chip_id);

        iss->target_chip_id = chip_id;
      }
              
