monte-monte/ch32v003fun/minichlink/minichlink.c
int DefaultDelayUS( void * dev, int us )
{
#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
	Sleep( (us+9999) / 1000 );
#else
	usleep( us );
#endif
	return 0;
}

int SetupAutomaticHighLevelFunctions( void * dev )
{
	// Will populate high-level functions from low-level functions.
	if( MCF.WriteReg32 == 0 && MCF.ReadReg32 == 0 && MCF.WriteWord == 0 ) return -5;

	// Else, TODO: Build the high level functions from low level functions.
	// If a high-level function alrady exists, don't override.

	if( !MCF.SetupInterface )
		MCF.SetupInterface = DefaultSetupInterface;
	if( !MCF.DetermineChipType )
		MCF.DetermineChipType = DefaultDetermineChipType;
	if( !MCF.WriteBinaryBlob )
		MCF.WriteBinaryBlob = DefaultWriteBinaryBlob;
	if( !MCF.ReadBinaryBlob )
		MCF.ReadBinaryBlob = DefaultReadBinaryBlob;
	if( !MCF.WriteWord )
		MCF.WriteWord = DefaultWriteWord;
	if( !MCF.WriteHalfWord )
		MCF.WriteHalfWord = DefaultWriteHalfWord;
	if( !MCF.WriteByte )
		MCF.WriteByte = DefaultWriteByte;
	if( !MCF.ReadCPURegister )
		MCF.ReadCPURegister = DefaultReadCPURegister;
	if( !MCF.WriteCPURegister )
		MCF.WriteCPURegister = DefaultWriteCPURegister;
	if( !MCF.WriteAllCPURegisters )
		MCF.WriteAllCPURegisters = DefaultWriteAllCPURegisters;
	if( !MCF.ReadAllCPURegisters )
		MCF.ReadAllCPURegisters = DefaultReadAllCPURegisters;
	if( !MCF.SetEnableBreakpoints )
		MCF.SetEnableBreakpoints = DefaultSetEnableBreakpoints;
	if( !MCF.ReadWord )
		MCF.ReadWord = DefaultReadWord;
	if( !MCF.ReadHalfWord )
		MCF.ReadHalfWord = DefaultReadHalfWord;
	if( !MCF.ReadByte )
		MCF.ReadByte = DefaultReadByte;
	if( !MCF.Erase )
		MCF.Erase = DefaultErase;
	if( !MCF.HaltMode )
		MCF.HaltMode = DefaultHaltMode;
	if( !MCF.SetSplit )
		MCF.SetSplit = DefaultSetSplit;
	if( !MCF.PollTerminal )
		MCF.PollTerminal = DefaultPollTerminal;
	if( !MCF.WaitForFlash )
		MCF.WaitForFlash = DefaultWaitForFlash;
	if( !MCF.WaitForDoneOp )
		MCF.WaitForDoneOp = DefaultWaitForDoneOp;
	if( !MCF.PrintChipInfo )
		MCF.PrintChipInfo = DefaultPrintChipInfo;
	if( !MCF.Unbrick )
		MCF.Unbrick = DefaultUnbrick;
	if( !MCF.ConfigureNRSTAsGPIO )
		MCF.ConfigureNRSTAsGPIO = DefaultConfigureNRSTAsGPIO;
	if( !MCF.VoidHighLevelState )
		MCF.VoidHighLevelState = DefaultVoidHighLevelState;
	if( !MCF.DelayUS )
		MCF.DelayUS = DefaultDelayUS;

	return 0;
}




void TestFunction(void * dev )
{
	uint32_t rv;
	int r;
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Make the debug module work properly.
	MCF.WriteReg32( dev, DMCONTROL, 0x80000001 ); // Initiate a halt request.
	MCF.WriteReg32( dev, DMCONTROL, 0x00000001 ); // Clear Halt Request.

	r = MCF.WriteWord( dev, 0x20000100, 0xdeadbeef );
	r = MCF.WriteWord( dev, 0x20000104, 0xcafed0de );
	r = MCF.WriteWord( dev, 0x20000108, 0x12345678 );
	r = MCF.WriteWord( dev, 0x20000108, 0x00b00d00 );
	r = MCF.WriteWord( dev, 0x20000104, 0x33334444 );

	r = MCF.ReadWord( dev, 0x20000100, &rv );
	printf( "**>>> %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x20000104, &rv );
	printf( "**>>> %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x20000108, &rv );
	printf( "**>>> %d %08x\n", r, rv );


	r = MCF.ReadWord( dev, 0x00000300, &rv );
	printf( "F %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x00000304, &rv );
	printf( "F %d %08x\n", r, rv );
	r = MCF.ReadWord( dev, 0x00000308, &rv );
	printf( "F %d %08x\n", r, rv );

	uint8_t buffer[256];
	int i;
	for( i = 0; i < 256; i++ ) buffer[i] = 0;
	MCF.WriteBinaryBlob( dev, 0x08000300, 256, buffer );
	MCF.ReadBinaryBlob( dev, 0x08000300, 256, buffer );
	for( i = 0; i < 256; i++ )
	{
		printf( "%02x ", buffer[i] );
		if( (i & 0xf) == 0xf ) printf( "\n" );
	}

	for( i = 0; i < 256; i++ ) buffer[i] = i;
	MCF.WriteBinaryBlob( dev, 0x08000300, 256, buffer );
	MCF.ReadBinaryBlob( dev, 0x08000300, 256, buffer );
	for( i = 0; i < 256; i++ )
	{
		printf( "%02x ", buffer[i] );
		if( (i & 0xf) == 0xf ) printf( "\n" );
	}
}

int DetectMemoryArea( void * dev, uint32_t address )
{
  struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
  if( !iss->target_chip )
  {
    MCF.DetermineChipType( dev );
  }
  const struct RiscVChip_s * chip = iss->target_chip;
  fprintf( stderr, "Detecting Memory Area\n" );
  if( address < chip->flash_offset)
  {
    fprintf( stderr, "The starting address is lower than FLASH start. Aborting\n" );
    return -1;
  }
  if( address < chip->flash_offset + chip->flash_size )
  {
    iss->current_area = PROGRAM_AREA;
    return 0;
  }
  else if( chip->bootloader_size > 0 && 
          address >= chip->bootloader_offset &&
          address < chip->bootloader_offset + chip->bootloader_size )
  {
    iss->current_area = BOOTLOADER_AREA;
    return 0;
  }
  else if( chip->options_size > 0 && 
          address >= chip->options_offset &&
          address < chip->options_offset + chip->options_size )
  {
    iss->current_area = OPTIONS_AREA;
    return 0;
  }
  else if( chip->eeprom_size > 0 && 
          address >= chip->eeprom_offset &&
          address < chip->eeprom_offset + chip->eeprom_size )
  {
    iss->current_area = EEPROM_AREA;
    return 0;
  }
  else if( address >= chip->ram_base )
  {
    iss->current_area = RAM_AREA;
    return 0;
  }

  fprintf( stderr, "Something went wrong and we couldn't detect memory region\n" );
  return -2;
}

int CheckMemoryLocation( void * dev, enum MemoryArea area, uint32_t address, uint32_t length )
{
  struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
  if( !iss->target_chip )
  {
    MCF.DetermineChipType( dev );
  }
  const struct RiscVChip_s * chip = iss->target_chip;

  if( area == DEFAULT_AREA )
  {
    if( iss->current_area == 0 ) DetectMemoryArea( dev, address );
    area = iss->current_area;
  }

  if( chip->protocol == PROTOCOL_UNSUPPORTED )
  {
    fprintf(stderr, "Flashing this MCU model is not yet supported in minichlink.\n");
    fprintf(stderr, "But you can still use other functions, like working with RAM, or debug registers.\n");
    return 0;
  }

  fprintf(stderr, "Area = %d; current_area = %d; address = %d; length = %d\n", area, iss->current_area, address, length);

  switch (area)
  {
  case DEFAULT_AREA:
    return 0;
  case PROGRAM_AREA:
    if( address >= chip->flash_offset &&
        address < (chip->flash_offset + chip->flash_size) &&
        (address + length) <= (chip->flash_offset + chip->flash_size) )
    {
      return 1;
    }
    else
    break;
  case BOOTLOADER_AREA:
    if( chip->bootloader_size > 0 &&
        address >= chip->bootloader_offset &&
        address < chip->bootloader_offset + chip->bootloader_size &&
        address + length <= chip->bootloader_offset + chip->bootloader_size )
    {
      return 1;
    }
    break;
  case OPTIONS_AREA:
    if( chip->options_size > 0 &&
        address >= chip->options_offset &&
        address < chip->options_offset + chip->options_size &&
        address + length <= chip->options_offset + chip->options_size )
    {
      return 1;
    }
    break;
  case EEPROM_AREA:
    if( chip->eeprom_size > 0 &&
        address >= chip->eeprom_offset &&
        address < chip->eeprom_offset + chip->eeprom_size &&
        address + length <= chip->eeprom_offset + chip->eeprom_size )
    {
      return 1;
    }
    break;
  case RAM_AREA:
    if( address >= chip->ram_base)
    {
      return 1;
    }
    break;
  }

  return 0;
}